app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','NC-17','PG','PG-13','R')) ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."G" = '1'
---
  def index
    if (params[:sort] == 'title')
      @movies = Movie.find(:all, :order => 'title')
      @title_header_class = 'hilite'
      @release_date_header_class = ''
    elsif (params[:sort] == 'release_date')
      @movies = Movie.find(:all, :order => 'release_date')
      @release_date_header_class = 'hilite'
      @title_header_class = ''
    else
      @movies = Movie.all
      @title_header_class = ''
      @release_date_header_class = ''
    end
    if (params[:commit] == 'Refresh')
      @movies = Movie.find(:all, :conditions => ["rating IN (?)", params[:ratings].keys])